Repository: BillDennisz/a-small-project
Catalog: locale/*/LC_MESSAGES/*_work1_fun.po
Languages: fr

source: You can restart now and select the language !
fr: Vous pouvez redémarrer maintenant et sélectionner la langue!

source: OK
fr: D'accord

source: Count the number of words per minute in the subtitle file and generate a text file
fr: Comptez le nombre de mots par minute dans le fichier de sous-titres et générez un fichier texte

source: Object path:
fr: Chemin d’objet :

source: Output path:
fr: Production chemin:

source: Customize extension:
fr: Personnaliser extension:

source: Information
fr: Informations

source: Browse
fr: Parcourir

source: Quit
fr: Quitter

source: Start
fr: Début

source: Recover
fr: Se remettre

source: Rename
fr: Renommer

source: Process files in subfolders
fr: Traiter les fichiers dans les sous-dossiers

source: Output files
fr: Fichiers de sortie

source: New
fr: Nouveau

source: Show information list
fr: Afficher la liste d'informations

source: Clear information list
fr: Effacer la liste d'informations

source: Show the selected option
fr: Afficher l'option sélectionnée

source: Are you sure to quit ?
fr: Êtes-vous sûr de cesser de fumer?

source: Quit！
fr: Quitter！

source: Are you sure to quit ?
fr: Êtes-vous sûr de cesser de fumer?

source: No list information currently ！
fr: Aucune information de liste actuellement！

source: * Output: new file name | Word number in total | Total time of the subtitle | Word number per minute
fr: * Sortie: nouveau nom de fichier | Nombre de mots au total | Durée totale du sous-titre | Nombre de mots par minute

source: Word number in total:
fr: Nombre de mots au total:

source: Total time of the subtitle(min):
fr: Durée totale du sous-titre (min):

source: Word number per minute:
fr: Nombre de mots par minute:

source: Print information error !
fr: Erreur d'impression des informations!

source: The file path cannot be empty !
fr: Le chemin de fichier ne peut pas être vide !

source: The path of output files should not be empty !
fr: Le chemin des fichiers de sortie ne doit pas être vide!

source: Use the default extension :
fr: Utilisez l'extension par défaut:

source: Use the default extension : {}
fr: Utilisez l'extension par défaut: {}

source: * The files are sorted as follows :
fr: * Les fichiers sont triés comme suit:

source: >> The running time is {:.3f} s
fr: >>>>> La durée totale de fonctionnement est de {: .3f} s

source: * System error !
fr: * Erreur système !

source: ================================ This is the dividing line =============================
fr: ================================ Ceci est la ligne de division ============= ================

source: Reselect language
fr: Resélectionnez la langue

source: Language
fr: Langue

source: See help
fr: Voir l'aide

source: About
fr: À propos de

source: Help
fr: Aider

source: Open the file
fr: Fichier ouvert

source: {} files need to be renamed !
fr: {} fichiers doivent être renommés!

source: {} files need to be recovered !
fr: {} fichiers doivent être récupérés!

source: Rename finished ! {} files done !
fr: Renommer terminé! {} fichiers terminés!

source: Recover finished ! {} files done !
fr: Récupérez terminé! {} fichiers terminés!

source: Not rename any file.
fr: Ne renommez aucun fichier.

source: * Searching all files ......
fr: * Recherche de tous les fichiers ......

source: * Do not searching sub file folders ......
fr: * Ne pas rechercher dans les sous-dossiers de fichiers ......

source: The number of file paths is {}
fr: Le nombre de chemins de fichiers est {}

source: Was it the file we want?
fr: Est-ce le fichier que nous voulons?

source: Yes
fr: Oui

source: No
fr: Non

source: * List ......
fr: * Lister ......

source: The number of file selected is {}
fr: Le nombre de fichiers sélectionnés est {}

source: -> the filename is : {}
fr: le nom du fichier est: {}

source: the sum of word number is :{}
fr: la somme du nombre de mots est: {}

source: the subtitle rate is : {}
fr: le taux de sous-titres est: {}

source: * Get the new name and new path ......
fr: * Obtenez le nouveau nom et le nouveau chemin ......

source: * Write the txt file ......
fr: * Ecrivez le fichier txt ......

source: * Rename or recover ......
fr: * Renommer ou récupérer ......

source: >>>>> The total running time is {:.3f} s
fr: >>>>> La durée totale de fonctionnement est de {: .3f} s
